Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KM101.h
#define _AD1CON5_LPEN_POSITION                   0x0000000E
#define _AD1CON5_LPEN_MASK                       0x00004000
#define _AD1CON5_LPEN_LENGTH                     0x00000001

#define _AD1CON5_ASEN_POSITION                   0x0000000F
#define _AD1CON5_ASEN_MASK                       0x00008000
#define _AD1CON5_ASEN_LENGTH                     0x00000001

#define _AD1CON5_CM0_POSITION                    0x00000000
#define _AD1CON5_CM0_MASK                        0x00000001
#define _AD1CON5_CM0_LENGTH                      0x00000001

#define _AD1CON5_CM1_POSITION                    0x00000001
#define _AD1CON5_CM1_MASK                        0x00000002
#define _AD1CON5_CM1_LENGTH                      0x00000001

#define _AD1CON5_WM0_POSITION                    0x00000002
#define _AD1CON5_WM0_MASK                        0x00000004
#define _AD1CON5_WM0_LENGTH                      0x00000001

#define _AD1CON5_WM1_POSITION                    0x00000003
#define _AD1CON5_WM1_MASK                        0x00000008
#define _AD1CON5_WM1_LENGTH                      0x00000001

#define _AD1CON5_ASINT0_POSITION                 0x00000008
#define _AD1CON5_ASINT0_MASK                     0x00000100
#define _AD1CON5_ASINT0_LENGTH                   0x00000001

#define _AD1CON5_ASINT1_POSITION                 0x00000009
#define _AD1CON5_ASINT1_MASK                     0x00000200
#define _AD1CON5_ASINT1_LENGTH                   0x00000001

#define _AD1CHITH_CHH16_POSITION                 0x00000000
#define _AD1CHITH_CHH16_MASK                     0x00000001
#define _AD1CHITH_CHH16_LENGTH                   0x00000001

#define _AD1CHITH_CHH19_POSITION                 0x00000003
#define _AD1CHITH_CHH19_MASK                     0x00000008
#define _AD1CHITH_CHH19_LENGTH                   0x00000001

#define _AD1CHITH_CHH20_POSITION                 0x00000004
#define _AD1CHITH_CHH20_MASK                     0x00000010
#define _AD1CHITH_CHH20_LENGTH                   0x00000001

#define _AD1CHITH_CHH21_POSITION                 0x00000005
#define _AD1CHITH_CHH21_MASK                     0x00000020
#define _AD1CHITH_CHH21_LENGTH                   0x00000001

#define _AD1CHITH_CHH22_POSITION                 0x00000006
#define _AD1CHITH_CHH22_MASK                     0x00000040
#define _AD1CHITH_CHH22_LENGTH                   0x00000001

#define _AD1CHITH_CHH23_POSITION                 0x00000007
#define _AD1CHITH_CHH23_MASK                     0x00000080
#define _AD1CHITH_CHH23_LENGTH                   0x00000001

#define _AD1CHITL_CHH0_POSITION                  0x00000000
#define _AD1CHITL_CHH0_MASK                      0x00000001
#define _AD1CHITL_CHH0_LENGTH                    0x00000001

#define _AD1CHITL_CHH1_POSITION                  0x00000001
#define _AD1CHITL_CHH1_MASK                      0x00000002
#define _AD1CHITL_CHH1_LENGTH                    0x00000001

#define _AD1CHITL_CHH2_POSITION                  0x00000002
#define _AD1CHITL_CHH2_MASK                      0x00000004
#define _AD1CHITL_CHH2_LENGTH                    0x00000001

#define _AD1CHITL_CHH3_POSITION                  0x00000003
#define _AD1CHITL_CHH3_MASK                      0x00000008
#define _AD1CHITL_CHH3_LENGTH                    0x00000001

#define _AD1CHITL_CHH4_POSITION                  0x00000004
#define _AD1CHITL_CHH4_MASK                      0x00000010
#define _AD1CHITL_CHH4_LENGTH                    0x00000001

#define _AD1CHITL_CHH9_POSITION                  0x00000009
#define _AD1CHITL_CHH9_MASK                      0x00000200
#define _AD1CHITL_CHH9_LENGTH                    0x00000001

#define _AD1CHITL_CHH10_POSITION                 0x0000000A
#define _AD1CHITL_CHH10_MASK                     0x00000400
#define _AD1CHITL_CHH10_LENGTH                   0x00000001

#define _AD1CHITL_CHH11_POSITION                 0x0000000B
#define _AD1CHITL_CHH11_MASK                     0x00000800
#define _AD1CHITL_CHH11_LENGTH                   0x00000001

#define _AD1CHITL_CHH12_POSITION                 0x0000000C
#define _AD1CHITL_CHH12_MASK                     0x00001000
#define _AD1CHITL_CHH12_LENGTH                   0x00000001

#define _AD1CHITL_CHH13_POSITION                 0x0000000D
#define _AD1CHITL_CHH13_MASK                     0x00002000
#define _AD1CHITL_CHH13_LENGTH                   0x00000001

#define _AD1CHITL_CHH14_POSITION                 0x0000000E
#define _AD1CHITL_CHH14_MASK                     0x00004000
#define _AD1CHITL_CHH14_LENGTH                   0x00000001

#define _AD1CHITL_CHH15_POSITION                 0x0000000F
#define _AD1CHITL_CHH15_MASK                     0x00008000
#define _AD1CHITL_CHH15_LENGTH                   0x00000001

#define _CTMUCON1L_IRNG_POSITION                 0x00000000
#define _CTMUCON1L_IRNG_MASK                     0x00000003
#define _CTMUCON1L_IRNG_LENGTH                   0x00000002

#define _CTMUCON1L_ITRIM_POSITION                0x00000002
#define _CTMUCON1L_ITRIM_MASK                    0x000000FC
#define _CTMUCON1L_ITRIM_LENGTH                  0x00000006

#define _CTMUCON1L_CTTRIG_POSITION               0x00000008
#define _CTMUCON1L_CTTRIG_MASK                   0x00000100
#define _CTMUCON1L_CTTRIG_LENGTH                 0x00000001

#define _CTMUCON1L_IDISSEN_POSITION              0x00000009
#define _CTMUCON1L_IDISSEN_MASK                  0x00000200
#define _CTMUCON1L_IDISSEN_LENGTH                0x00000001

#define _CTMUCON1L_EDGSEQEN_POSITION             0x0000000A
#define _CTMUCON1L_EDGSEQEN_MASK                 0x00000400
#define _CTMUCON1L_EDGSEQEN_LENGTH               0x00000001

#define _CTMUCON1L_EDGEN_POSITION                0x0000000B
#define _CTMUCON1L_EDGEN_MASK                    0x00000800
#define _CTMUCON1L_EDGEN_LENGTH                  0x00000001

#define _CTMUCON1L_TGEN_POSITION                 0x0000000C
#define _CTMUCON1L_TGEN_MASK                     0x00001000
#define _CTMUCON1L_TGEN_LENGTH                   0x00000001

#define _CTMUCON1L_CTMUSIDL_POSITION             0x0000000D
#define _CTMUCON1L_CTMUSIDL_MASK                 0x00002000
#define _CTMUCON1L_CTMUSIDL_LENGTH               0x00000001

#define _CTMUCON1L_CTMUEN_POSITION               0x0000000F
#define _CTMUCON1L_CTMUEN_MASK                   0x00008000
#define _CTMUCON1L_CTMUEN_LENGTH                 0x00000001

#define _CTMUCON1L_IRNG0_POSITION                0x00000000
#define _CTMUCON1L_IRNG0_MASK                    0x00000001
#define _CTMUCON1L_IRNG0_LENGTH                  0x00000001

